Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: །བྱང་གི་སྒྲ་མི་སྙན་ལ་ལར་ནི་ཡོན་གནས་ལྟ་བུར་སྟོན་ཏེ། འཇིག་རྟེན་ན་ཡོན་གནས་ཡིན་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་ཡོན་གནས་ཀྱི་ང་རྒྱལ་ལ་ཡང་མི་སྤྱོད་དེ།
en: In each and every Uttarakuru continent, they display themselves as objects worthy of veneration, and sentient beings observe them as objects worthy of the entire world’s veneration. Yet, these bodhisattvas do not act with the pride of one who is an object worthy of veneration.

source: ནམ་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོན་གནས་སུ་གྱུར་པ་དེའི་ཚེ་བདག་ཡོན་གནས་ཀྱི་འདུ་ཤེས་ལ་འཇུག་གོ་སྙམ་ནས་མ་གོས་པའི་སྤྱད་པ་ལ་སྤྱོད་དོ།
en: Thinking, ‘I will not engage in the conception of being an object worthy of veneration until such time as all sentient beings have become objects worthy of veneration by attaining unsurpassed, complete, and perfect awakening,’ they engage in unblemished conduct. “

source: །བྱང་གི་སྒྲ་མི་སྙན་ལ་ལར་ནི་དགེ་འདུན་གྱི་དབྱེན་བྱེད་པ་ལྟ་བུར་སྟོན་ཏེ། དགེ་འདུན་གྱི་དབྱེན་བྱེད་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་།
en: In each and every Uttarakuru continent, they display themselves as creating schism among the saṅgha, and sentient beings observe them as having created schism among the saṅgha.

source: སྔོན་གྱི་བསྐལ་པ་གྲངས་མེད་པ་ནས་དགེ་འདུན་གྱི་དབྱེན་སྔོན་ཆད་ཀྱང་མ་བྱས་ཏེ་དགེ་འདུན་ལ་ཕན་པར་སྒྲུབ་པ་སྤྱོད་པ་ཡིན་ནོ།
en: Yet, over countless tens of millions of eons, these bodhisattvas have never before created any schism among the saṅgha but rather have acted to bring benefit to the saṅgha. “

source: །བྱང་གི་སྒྲ་མི་སྙན་ལ་ལར་ནི་དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱིས་རེག་པའི་རྡུལ་གུད་དུ་འདོར་བར་བྱེད་པ་ལྟ་བུར་སྟོན་ཏེ།
en: In each and every Uttarakuru continent, they display themselves as casting aside the dust that has been touched by the Tathāgata’s feet, and sentient beings observe this, thinking,

source: ཀྱེ་མ་ངུར་སྨྲིག་ཙམ་འཆང་ཞིང་མི་ཟད་པའི་ལས་བྱེད་པ་ཞིག་ཡིན་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་། ངུར་སྨྲིག་ཙམ་འཆང་བ་ཡང་མ་ཡིན་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བ་སྟོན་པ་ཡང་ཡིན་ནོ།
en: ‘Ah! This is one who merely wears the saffron-colored robes but engages in unbearable deeds.’ Yet, these bodhisattvas do not merely wear the saffron-colored robes. Rather, they benefit all sentient beings and guide them to happiness.

source: །དེ་ལ་སོགས་པ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་དུ་ཆོས་ཉན་པ་ཐོས་པ་ནས།
en: Similarly, they moreover display themselves as complaining when they hear the teachings of Dharma at the Tathāgata’s feet, saying,

source: ཀྱེ་མ་དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་བརྡ་ཕྲད་དཀའ་བ་ཤ་སྟག་ཟེར་རོ་ཞེས་བྱ་བ་ལྟ་བུར་སྟོན་ཏེ།
en: ‘Ah! This recluse Gautama only speaks in words that are hard to understand.’

source: ཀྱེ་མ་གཡེངས་པ་ཤེས་རབ་རྟུལ་བའི་དགེ་སློང་ཞིག་ཡིན་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་།
en: Sentient beings observe this, thinking, ‘Ah! This is a distracted monk with dull wisdom.’

source: བསྐལ་པ་བྱེ་བ་ཕྲག་དུ་མ་ནས་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ལ་ཕན་པ་དང་། བདེ་བ་བྱེད་པ་ཡང་ཡིན་ནོ།
en: Yet, over many tens of millions of eons, these bodhisattvas have acted to benefit and please the Tathāgata. “

source: །བྱང་གི་སྒྲ་མི་སྙན་ལ་ལར་ནི་དེ་བཞིན་གཤེགས་པ་ལ་ཟས་དུག་ཅན་འབུལ་ཞིང་བསླབ་པའི་གཞི་དང་། ཕམ་པའི་འགལ་བ་བྱེད་པ་ལྟ་བུར་སྟོན་ཏེ། ཕམ་པ་ཅན་དུ་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་།
en: In each and every Uttarakuru continent, they display themselves as offering poisoned food to the Tathāgata, violating the basic precepts, and committing unforgivable offenses, and sentient beings observe them as violators of the precepts.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་སྡོམ་པ་སྐྱེད་པར་བྱེད་པ་ཡང་ཡིན་ནོ།
en: Yet, these bodhisattvas cause all sentient beings to uphold the disciplinary precepts. “

source: །བྱང་གི་སྒྲ་མི་སྙན་ལ་ལར་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མཛད་པ་མང་པོ་སྟོན་པ་ལྟ་བུར་སྟོན་ཏེ།
en: In each and every Uttarakuru continent, they display the many deeds of the tathāgatas, and sentient beings observe them as perfect teachers.

source: ཡང་དག་པར་སྟོན་པ་པོ་ཡིན་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་ཡང་དག་པར་སྟོན་པ་པོ་ཡང་མ་ཡིན་ཏེ་དེ་བཞིན་གཤེགས་པའི་རྒྱན་བྱེད་པ་ཡིན་ནོ།
en: Yet, these bodhisattvas are not perfect teachers. They are engaging in the adornments of the Tathāgata. “

source: །བྱང་གི་སྒྲ་མི་སྙན་ལ་ལར་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལྟ་བུར་བདག་ཉིད་སྟོན་ཏེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཡིན་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་སོ།
en: In each and every Uttarakuru continent, they display themselves as śrāvakas and pratyekabuddhas, and sentient beings observe them as śrāvakas and pratyekabuddhas. “

source: །བྱང་གི་སྒྲ་མི་སྙན་ལ་ལར་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ལྟ་བུར་བདག་ཉིད་སྟོན་ཏེ།
en: In each and every Uttarakuru continent, they display themselves as passing into parinirvāṇa, and sentient beings observe them passing into parinirvāṇa.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་སྔོན་ཆད་གཏན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པས་ནི་ནམས་ཀྱང་ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་སོ།
en: Yet, because these bodhisattvas have already forever passed into parinirvāṇa, they will never pass into parinirvāṇa. “

source: །ལན་གྲངས་བྱེ་བ་ཕྲག་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱེད་དེ་ལན་བྱེ་བ་ཕྲག་ཉི་ཁྲི་ཆིག་སྟོང་དུ་འདོད་ཆགས་ལས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ལ་འདོད་ཆགས་ལས་བརྟེན་ཏེ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཡང་མ་ཡིན་ནོ།
en: By having passed into parinirvāṇa eight hundred forty billion times, they will pass into parinirvāṇa. By having passed into parinirvāṇa two hundred ten billion times from desire, they will eventually pass into parinirvāṇa, but it is not the case that they can pass into parinirvāṇa solely on the basis of desire.

source: །ལན་བྱེ་བ་ཕྲག་ཉི་ཁྲི་ཆིག་སྟོང་དུ་གཏི་མུག་ལས་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ།
en: They will pass into parinirvāṇa two hundred ten billion times from ignorance.

source: །ལན་བྱེ་བ་ཕྲག་ཉི་ཁྲི་ཆིག་སྟོང་དུ་ཆ་མཉམ་པ་ལས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱེད་དེ།
en: They will pass into parinirvāṇa two hundred ten billion times from an equal combination of desire, anger, and ignorance.

source: རྣམ་པ་བཞི་པོ་འདི་ལྟ་བུས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ལ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ཆ་མཉམ་པ་ལ་ཡང་མི་བརྟེན་ནོ།
en: By passing into parinirvāṇa in these four ways, they will eventually pass into great parinirvāṇa, which does not depend on desire, anger, ignorance, or an equal combination of the three. “

source: །དེ་ལྟར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་བཞི་པོ་དག་གིས་བསྐལ་པ་བྱེ་བ་ཕྲག་དུ་མ་ནས་བྱ་བ་མཐར་ཕྱིན་ཏེ། འདུལ་བའི་དབང་གིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ལྟ་བུར་སྟོན་ཏོ།
en: Thus, by passing into these four great parinirvāṇas over many tens of millions of eons, they fulfill all their activities and, through their power to tame beings, display themselves as passing into parinirvāṇa.

source: །མི་དགེ་བའི་ཕྱོགས་ཇི་སྙེད་ཡོད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཡང་དེ་སྙེད་དེ།
en: However many aspects of nonvirtue exist, that is the number of times they will pass into parinirvāṇa.

source: །བྱང་གི་སྒྲ་མི་སྙན་ལ་ལར་ནི་བདུད་ཀྱི་ལས་བྱེད་པ་ལྟར་བདག་ཉིད་སྟོན་ཏེ། བདུད་སྡིག་ཅན་ཡིན་པར་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ཀྱང་། བདུད་ཀྱི་ལས་ཀྱང་མི་བྱེད་དོ།
en: In each and every Uttarakuru continent, they will display themselves performing the deeds of Māra, and sentient beings will observe them as evil Māra. Yet, these bodhisattvas do not perform the deeds of Māra.

source: །འཛམ་བུའི་གླིང་དང་། བྱང་གི་སྒྲ་མི་སྙན་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གླིང་ཐམས་ཅད་ལ་ཡང་སྦྱར་བར་བྱའོ།
en: Just as it is for the continents of Jambudvīpa and Uttarakuru, so it is for all the continents.

source: །རྒྱལ་ཆེན་བཞི་ལ་ལ་དག་ཏུ་འམ། དེ་བཞིན་དུ་སུམ་ཅུ་རྩ་གསུམ་པའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བའི་ནང་དུ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལྟ་བུར་བདག་ཉིད་སྟོན་ཏེ། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ཡིན་པར་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱིས་ཤེས་སོ།
en: They display themselves as each of the Four Great Kings, or as Śakra, Lord of the Devas, surrounded by the host of deities from the Heaven of the Thirty-Three, and the deities of the Heaven of the Thirty-Three observe them as Śakra, Lord of the Devas.

source: །འཇིག་རྟེན་སྐྱོང་བ་བཞི་ལ་ཡང་དེ་བཞིན་དུ་སྦྱར་རོ།
en: In a similar fashion, they display themselves as the Four World Guardians.

source: །སྲིད་པ་ཐམས་ཅད་དུ་ཡང་སྲིད་པ་ཐམས་ཅད་ཀྱི་ཚུལ་དུ་མངལ་དུ་སྐྱེ་བ་རྣམ་པར་སྟོན་ཏེ། སྲིད་པ་ཐམས་ཅད་ཀྱི་སེམས་ཅན་རྣམས་རང་རང་གི་གཟུགས་དང་འདྲ་བར་སེམས་སོ།
en: In all realms of existence, they display themselves being born from wombs into all manner of existences, and sentient beings in all manner of existences observe these bodhisattvas as appearing in the same forms as themselves.

source: །དེ་བཞིན་དུ་སྲིད་པའི་ཡན་ལག་བཅུ་གཉིས་ཀྱི་རང་བཞིན་ཐམས་ཅད་དུ་ཡང་བདག་ཉིད་སྟོན་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཁམས་ཀྱི་འདུ་ཤེས་ལ་འཇུག་པར་བྱེད་ལ།
en: Similarly, they display themselves as possessing all the natures of the twelve links of conditioned existence and as engaging in the conception of the realm of sentient beings.

source: སེམས་ཅན་གྱི་ཁམས་ལ་ཡང་མི་གནས་ཤིང་ཆོས་ཀྱི་དབྱིངས་ཡིན་ལ། རྟག་ཏུ་ཆོས་ཀྱི་གཏམ་བྱེད་པར་ཡང་སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་སོ།
en: However, they do not abide in the realm of sentient beings but rather in the Dharma realm, and sentient beings observe them as constantly discoursing on the Dharma. “

source: །སྤྲིན་ཆེན་སྙིང་པོ་དེ་བས་ན་ཟབ་མོ་བརྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཀྱི་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་འཇུག་པའི་གནས་ཀྱི་གཞི་གཅིག་ཏུ་ཆད་པ་མེད་དེ།
en: Therefore, Great Cloud Essence, bodhisattvas who abide in this samādhi of the tide of the deep, constant ocean are not bound to a single location as their basis of rebirth.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་རྒྱུ་བ་ལ་རྒྱུ་བར་མི་བྱེད་དོ།
en: They do not engage in the behavior belonging to the domains of the śrāvakas and pratyekabuddhas.

source: །འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པའི་བྱ་བ་དུ་མ་དང་། སེམས་ཅན་ཐམས་ཅད་ངེས་པར་བསྒྲལ་བའི་ཕྱིར་ནི་རྒྱུ་བར་ཡང་བྱེད་དེ།
en: To liberate all sentient beings, they carry out myriad activities that engage harmoniously with the world.

source: རྟག་ཏུ་འཇིག་རྟེན་ཐམས་ཅད་དང་འཐུན་པར་འཇུག་ཅིང་གང་དང་གང་དུ་གདུལ་བར་བྱ་བ་རྣམས་སྣང་བ་དེ་དང་དེར་ཡང་བདག་ཉིད་སྟོན་ཏེ།
en: Constantly engaging harmoniously with all worlds, they display themselves wherever there are beings to be tamed.

source: དེ་བས་ན་མཚན་མ་མེད་པའི་འདུ་ཤེས་ལ་སྤྱོད་པ་ཞེས་བྱའོ།
en: Therefore, this is called engaging in the conception of signlessness.

source: །གང་གིས་མཚན་མའི་དངོས་པོ་ངན་པའི་འདུ་ཤེས་མཐོང་བ་དེས་ནི་ཡང་དག་པར་མཐོང་ངོ་ཞེས་ང་སྨྲའོ།
en: I say that whoever sees that the conception of objects in terms of signs is inferior is one who sees correctly.

source: །ལྷ་མོ་དྲི་མ་མེད་པའི་འོད་འདི་མཚན་མ་མེད་པའི་ཡེ་ཤེས་སྟོན་པ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱང་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་འདི་སྟོན་པར་མཛད་དོ།
en: Just as the goddess Stainless Light has demonstrated this signless gnosis, so do all the tathāgatas demonstrate it to bodhisattvas who abide in this samādhi.”

source: །དེ་ནས་སྤྲིན་ཆེན་སྙིང་པོས་གསོལ་པ།
en: At this point, Great Cloud Essence said,

source: ཀྱེ་མ་བཅོམ་ལྡན་འདས་ལྷ་མོ་དྲི་མ་མེད་པའི་འོད་འདི་ནི་ཤིན་ཏུ་མཁས་ཏེ་ཕྲ་བ་ཤེས་པ་དང་ལྡན་ཞིང་མཚན་མ་མ་མཆིས་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་སྒོམ་པར་བགྱིད་དེ། ཤིན་ཏུ་ལེགས་པར་ཡང་དག་པར་མཐོང་བ་ལགས་སོ།
en: “Ah, Bhagavān! This goddess Stainless Light is extremely skilled. With subtle cognition she meditates upon the inconceivable domain of signless gnosis, and she sees perfectly and correctly.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཐམས་ཅད་མཁྱེན་ཅིང་ཐམས་ཅད་མཁྱེན་པ་དང་ལྡན་པས་འཛུམ་པ་མཛད་ནས་འོད་འཕྲོ་བ་སྔོན་པོ་དང་སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེབ་རྒན་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ཅན་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་བྱུང་སྟེ།
en: At that time the Bhagavān, knowing all this, endowed with the powers of omniscience, smiled and emitted rays of blue, yellow, red, white, ocher, clear, and silver light from his mouth.

source: འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པར་འོད་ཀྱིས་ཁྱབ་པར་གྱུར་ནས་ཚངས་པའི་འཇིག་རྟེན་ལ་ཐུག་པའི་བར་དུ་སོང་སྟེ་སླར་ཡང་ལོག་ནས། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱི་གཙུག་ཏུ་མི་སྣང་བར་གྱུར་ཏོ།
en: The light spread without limit throughout the infinite world systems, reaching all the way up to the Brahmā world, and then returned to circle three times around the Bhagavān before disappearing into his crown.

source: །དེའི་ཚེ་ས་རྣམ་པ་དྲུག་ཏུ་གཡོས་རབ་ཏུ་གཡོས། ལྡེག་རབ་ཏུ་ལྡེག་པར་གྱུར་ཏེ།
en: On that occasion, the earth shook, violently shook, quaked, and violently quaked with a sixfold earthquake. “

source: རིགས་ཀྱི་བུ་དཔེར་ན། བྱང་གི་སྒྲ་མི་སྙན་གྱི་གླིང་རྟག་ཏུ་ཤིན་ཏུ་བརྒྱན་ཅིང་ཁོ་ར་ཁོར་ཡུག་ནས་ཡོངས་སུ་མཛེས་པར་བྱས་པ་དེ་བཞིན་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལེགས་པར་བརྒྱན་པར་མཐོང་ངོ་།
en: To give an analogy, noble child, just as the Uttarakuru continent has been permanently, completely adorned and thoroughly beautified in all directions, in the same fashion the goddess sees this great trichiliocosm world-system as beautifully adorned.”

source: །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ནི་དོན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན།
en: At that time, the bodhisattva mahāsattva Great Cloud Essence rose from his seat, arranged his robe over one shoulder, and prostrated, touching his head to the Bhagavān’s feet, and then asked the Bhagavān, “Bhagavān, the tathāgatas do not smile without a reason.

source: འཛུམ་པ་མཛད་པའི་རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས།
en: Why did you smile so? What are the cause and conditions?

source: ཅིའི་སླད་དུ་ནི་འོད་ཟེར་རྣམས་བྱུང་བར་གྱུར།
en: For what purpose did you produce these rays of light?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འདི་ནི་སྔ་མའི་ཚེ་ནུབ་ཕྱོགས་ནས་བྱང་ཆུབ་སེམས་དཔའི་མར་གྱུར་པའི་འོད་ཆེན་པོ་བྱུང་བ་མཐོང་ནས་ཁྱོད་ཀྱི་ཡིད་ལ་ངོ་མཚར་དུ་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་འདི་སུའི་སྔ་ལྟས་ལགས་ཞེས་ཟེར་བ་དེ་ཉིད་ཀྱི་དོན་དང་།
en: The Bhagavān replied, “When you saw this great light that arose earlier when a bodhisattva from the western lands came down here, I knew that you would be amazed and would ask, ‘Bhagavān, for whom is this omen intended?’

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་ང་འཛུམ་པ་མཛད་དོ།
en: For this reason, and for the benefit of all sentient beings, I smiled so.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མི་མཆོག་དེ་མཆི་ཤིག་པར་བཀའ་སྩལ་དུ་གསོལ།
en: Bhagavān, I beseech you to cause that bodhisattva, that supreme being, to appear.” “

source: བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་ནུབ་ཕྱོགས་ལོགས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་ཅེས་བྱ་བ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ཞེས་བྱ་བ་དེ་ན་ད་ལྟར་འཚོ་ཞིང་གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེས་བཏང་སྟེ།
en: In the western direction there is a tathāgata, foe-destroyer, perfectly complete buddha named Amitābha, who presides over a world system called Blissful. This bodhisattva currently resides there happily.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ན་ད་ལྟར་འཛམ་བུའི་གླིང་པའི་མི་བསོད་ནམས་ཆུང་ངུ་རྣམས་ལ་ཕན་པ་དང་། བདེ་བ་དང་། ཡིད་དང་བ་སྐྱེ་བར་བྱ་བའི་ཕྱིར་སྤྲིན་ཆེན་པོ་ཞེས་བྱ་བའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཚུལ་གྱི་ཆོས་ཆེན་པོ་སྟོན་གྱིས་སོང་ལ་ཏིང་ངེ་འཛིན་འདི་ཡང་ཟུང་ཤིག་ཅེས་གསུངས་སོ།
en: The tathāgata, foe-destroyer, complete and perfect buddha Amitābha, while teaching the Dharma, has sent him off, saying, ‘Presently, in the world system called Endurance, the Bhagavān Śākyamuni is going to teach the great Dharma of all the buddhas known as The Great Cloud, in order to benefit, delight, and please the sentient beings of the Jambudvīpa continent who have little merit. You should go there and take up this samādhi.’

source: །སྤྲིན་ཆེན་སྙིང་པོ་ཁྱོད་ཀྱིས་འདིའི་རང་བཞིན་གྱི་ལུས་མཐོང་ངམ།
en: Great Cloud Essence, do you see his essential body?” “

source: གསོལ་པ་བཅོམ་ལྡན་འདས་འདིའི་རང་བཞིན་གྱི་ལུས་ཀྱི་ངོ་བོ་ལ་དཔག་ཚད་ས་ཡ་ཕྲག་དགུ་དང་དགུ་འབུམ་མཆིས་ཏེ། ལུས་ཆེ་ཞིང་སྣང་བ་ཆེན་པོར་གདའ་བ་མཐོང་ལགས་ན།
en: Bhagavān, I see well the nature of his essential body, which appears so great that it is nine million nine hundred thousand yojanas tall.

source: བཅོམ་ལྡན་འདས་ཀྱེ་མ་བྱང་ཆུབ་སེམས་དཔའ་ལུས་ཆེ་བ་འདིའི་མིང་ནི་ཅི་ཞེས་བགྱི།
en: Ah, Bhagavān! What is the name of this bodhisattva with such a great body?

source: གལ་ཏེ་ཐ་མལ་པའི་ལུས་འདི་འདྲ་བ་ལགས་ན་བསྒྱུར་བའི་ལུས་ཅི་འདྲ་བར་འགྱུར།
en: If his ordinary body is like this, then what sort of empowered manifestation body does he have?

source: ཇི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ལ་སྨན་པའི་སླད་དུ་མཆིས་པ།
en: In what manner does he act as physician for all sentient beings?

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྨན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: As a physician to all sentient beings, I beseech the Bhagavān to explain.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་འོད་མཐའ་ཡས་ཞེས་བྱ་བ་ཐབས་ལ་མཁས་པ་འདི་ནི་ལྷ་མོ་དྲི་མ་མེད་པའི་འོད་འདི་ལུང་བསྟན་པ་ཡོངས་སུ་གཟུང་བ་དང་།
en: The Bhagavān replied, “This bodhisattva who is skilled in means is named Infinite Light.

source: སེམས་ཅན་ཐམས་ཅད་ཡིད་དང་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བར་བྱ་བ་དང་། ངེས་པར་བསྒྲལ་བ་དང་། ཏིང་ངེ་འཛིན་འདི་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་འོངས་སོ།
en: He has come here in order to hear the prophecy concerning the goddess Stainless Light, to make sentient beings happy, to benefit, delight, and liberate sentient beings, and to pay homage to this samādhi.” “

source: །གསོལ་པ། ལྷ་མོ་དྲི་མ་མེད་པའི་འོད་གང་དུ་བུད་མེད་ཀྱི་ལུས་ལས་ལྡོག་པར་འགྱུར་བ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ལུང་བསྟན་ཏུ་གསོལ།
en: I beseech the Bhagavān Tathāgata to give a prophecy explaining when the goddess Stainless Light will leave behind her female form.” “

source: བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་བུད་མེད་ཀྱི་ལུས་ལས་གང་དུ་ལྡོག་པར་འགྱུར་ཞེས་དེ་ལྟར་མ་ལྟ་ཤིག་གསོལ་པ།
en: Great Cloud Essence, you should not view this in terms of ‘leaving behind the female form.’

source: བཅོམ་ལྡན་འདས་འོ་ན་ཇི་ལྟ་བུ་ལགས།
en: ” “How then, Bhagavān?” “

source: བཀའ་སྩལ་པ། འདི་ནི་བུད་མེད་མ་ཡིན་ཏེ།
en: She is not a woman.

source: ལྷ་མོ་དྲི་མ་མེད་པའི་འོད་འདི་ནི་བསྐལ་པ་བྱེ་བ་ཕྲག་གྲངས་མེད་པ་ནས་བྱང་ཆུབ་སེམས་དཔའི་བྱ་བ་བྱེད་པ་ཡིན་ཏེ།
en: The goddess Stainless Light has performed the activities of a bodhisattva over countless tens of millions of eons.

source: སེམས་ཅན་འདུལ་བའི་དབང་གིས་བུད་མེད་ཀྱི་ལུས་འཛིན་པས་ན་འདི་ནི་ཐབས་ཀྱི་ལུས་ཡིན་པར་བལྟའོ།
en: She has taken up a woman’s body through her power to tame sentient beings. Therefore, you should see hers as a body of skillful means.

source: །ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྟག་ཏུ་ཐབས་ཐམས་ཅད་ལ་འཇུག་པའི་ཕྱིར་སེམས་ཀྱི་སྨོན་ལམ་གྱིས་སྨོན་པར་བྱེད་དེ་འདོད་བཞིན་དུ་བུད་མེད་ཀྱི་ལུས་ཀྱི་འདུ་ཤེས་ལ་འཇུག་གོ།
en: Since bodhisattva mahāsattvas who abide in this samādhi constantly engage in all manner of skillful means, they make the mental aspiration to engage in the conception of a desirable woman’s body.

source: །དེ་ལྟར་བུད་མེད་ཀྱི་ལུས་བསྒྲུབ་པའི་བསམ་པ་ལས་འཇུག་ཀྱང་འདོད་པའི་སེམས་ཀྱིས་གོས་པར་མི་འགྱུར་ཞིང་འདྲེས་པར་ཡང་མི་འགྱུར་རོ།
en: Thus, thinking of attaining a woman’s body they engage in doing so, and yet they are not sullied or contaminated by thoughts of desire.” “

source: །གསོལ་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་སླད་དུ་ལྷ་མོ་དྲི་མ་མེད་པའི་འོད་ལུང་བསྟན་པ་རིགས་དང་། གྲོང་དང་བཅས་པར་ཆོ་ག་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་འདིར་བཤད་དུ་གསོལ།
en: For the benefit of all sentient beings, I beseech the Bhagavān to give a prophecy here explaining in what family and town the goddess Stainless Light will perform her activities.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷ་མོ་དྲི་མ་མེད་པའི་འོད་འདི་ནི་ང་ཐབས་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་ལོ་བདུན་བརྒྱ་ལོན་པ་ན་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་དུ་ཡུལ་འཁོར་མུན་པ་ཅན་ཞེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ།
en: The Bhagavān replied, “Seven hundred years after I have passed into parinirvāṇa through skillful means, this goddess Stainless Light will be born in the southern region, into a country called Benighted.

source: ཡུལ་འཁོར་ཆེན་པོ་དེ་ན་ཆུ་ཀླུང་ནག་པོ་བཟང་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དེའི་ལྷོ་ཕྱོགས་ཀྱི་འགྲམ་ན་གྲོང་ཁྱེར་དཔལ་ཡོན་ཅན་ངེས་པ་ཞེས་བྱ་བར་ཁམས་ཀྱི་རྒྱལ་པོ་བདེ་སྤྱོད་ཅེས་བྱ་བའི་རིགས་སུ་འབྱུང་བར་འགྱུར་ཏེ།
en: Within that great country there will be a river called Fine Blackness. On the southern banks of that river there will be a city called Definitively Possessing Noble Qualities, where there will arise a royal family named Enjoying Bliss.

source: ཁམས་ཀྱི་རྒྱལ་པོ་དེའི་རིགས་རབས་གསུམ་ལོན་པ་ན་རྒྱལ་པོ་དཔལ་འཕེལ་ཞེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ།
en: After three generations, within that family there will arise a king named Increasing Majesty.

source: རྒྱལ་པོ་དེའི་བུ་མོ་སྙིང་དུ་སྡུག་ཅིང་བྱམས་ལ་ཡིད་དུ་འོང་བ་དང་། གནང་བ་དང་མཆོག་ཏུ་མཛེས་ཤིང་གཟུགས་བཟང་ལ་རིགས་ཀྱི་སྤྱོད་པའི་ཚུལ་ཕུན་སུམ་ཚོགས་པ་སྐྱོང་བའི་རང་བཞིན་ཅན་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: That king will have a beloved and cherished daughter, beautiful to behold, perfumed and beautifully adorned, who by nature upholds the perfect conduct of the family of the Tathāgata.

source: དེའི་ཚེ་དེའི་དུས་ན་བུ་མོ་དེ་ཇི་ཙམ་དུ་སྐྱེས་པ་དེ་ཙམ་དུ་བདག་ཉིད་ཀྱི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་འཕེལ་བར་བྱེད་དེ། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དེ་འབྱོར་ཅིང་རྒྱས་པར་འགྱུར་རོ། །དེ་བཞིན་དུ་མུན་པ་ཅན་གྱི་ཡུལ་འཁོར་ཡང་དེའི་ཚེ་འབྱོར་ཅིང་རྒྱས་པར་འགྱུར་ཏེ་སྐྱེ་བོ་མང་པོས་ཀྱང་གང་བར་འགྱུར་རོ།
en: As his daughter grows, so will the fortune of the capital increase, so that that royal city will become very prosperous and large, and similarly the entire country of Benighted will become larger and more prosperous.

source: །འབྲུ་རྣམས་ཀྱི་ལོ་ཏོག་ཀྱང་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་རོ།
en: All the grains will produce abundant harvests.

source: །མི་རྣམས་ཀྱང་བདེན་པར་སྨྲ་བར་འགྱུར་རོ།
en: All the people will speak truthfully.

source: །ནད་མེད་པ་དང་། འཇིགས་པ་མེད་པ་དང་། བདེ་བར་ཡང་འགྱུར་རོ།
en: Without sickness or fear, they will all become joyful. “

source: །དེ་ནས་བུ་མོའི་ཕ་རྒྱལ་པོ་དཔལ་འཕེལ་གྱིས་བདག་ཉིད་ཀྱི་བསོད་ནམས་ཀྱིས་གྲོང་ཁྱེར་དང་། ཡུལ་འཁོར་འབྱོར་ཅིང་རྒྱས་ལ་ཡུལ་གྱི་མི་རྣམས་ཤིན་ཏུ་ལེགས་པར་འཁོད་པ་དང་།
en: At that time, her father, the king Increasing Majesty, will see how, through his own merit, all the people are dwelling happily and all the crops are flourishing in his prosperous and large kingdom.

source: འབྲུ་ཤིན་ཏུ་ཚོགས་པར་མཐོང་ནས་བདག་ཉིད་ཀྱི་བུ་མོའི་མིང་ལོ་ཏོག་འབྱོར་མ་ཞེས་ཡོན་ཏན་དང་འཐུན་པའི་མིང་འདོགས་སོ།
en: He will give his daughter the name Abundant Harvest, to correspond with her virtuous qualities.

source: །དེ་ནས་རིམ་གྱིས་རྒྱལ་པོ་དཔལ་འཕེལ་རང་གི་བསོད་ནམས་ཟད་ནས་འཆི་བའི་དུས་བྱེད་པར་འགྱུར་རོ།
en: Then, as the king Increasing Majesty’s merit is gradually exhausted, he will approach the time of his death.

source: །དེ་ནས་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་གྱི་མི་རྣམས་འདུས་ཏེ། གཞོན་ནུ་རྒྱལ་པོ་ནུས་པ་འགའ་ཡང་མེད་ཀྱིས་ལྷ་མོ་ལོ་ཏོག་འབྱོར་མ་འདི་ཉིད་རྒྱལ་པོར་དབང་བསྐུར་ལ་རྒྱལ་པོའི་ཕོ་བྲང་དུ་དེ་འདྲ་བའི་གཞོན་ནུ་འགའ་ཞིག་མིང་ཁྱེར་ཙམ་དུ་བཞག་སྟེ།
en: All the people from the city, its environs, and the entire land will gather, thinking, ‘Although the young prince is not capable of becoming king, this princess Abundant Harvest could herself be empowered as king, and the prince installed in the palace as king in name only.

source: དེ་ལྟར་བྱས་ན་ལེགས་སོ་སྙམ་མོ།
en: It would be excellent if this were done.”

source: །དེ་ནས་ལྷ་མོ་དེ་དང་། རྒྱལ་བུ་གཞོན་ནུ་དེ་རྒྱལ་པོ་བྱེད་དུ་བཅུག་སྟེ། ཕོ་འུད་ཏི་མོ་འུད་ཏི་བཞིན་དུ་སྙད་བཏགས་ནས་བདག་ཉིད་ཀྱི་ཡུལ་དུ་བདག་ཉིད་ཀྱིས་བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་རྒྱལ་སྲིད་ཆེན་པོ་ཡོངས་སུ་སྤྱད་དེ།
en: Then, the princess and the prince will do so, becoming installed as rulers under the assumed names of Mr. and Mrs. Wudi, and she herself will rule over her homeland, administering the great kingdom in her female form.

source: མུ་སྟེགས་ཅན་ངན་པའི་སྡེ་མངོན་པར་འདུལ་བར་བྱེད་ཅིང་འཛམ་བུའི་གླིང་གི་ས་གཞི་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་གྱི་མངོན་མཚན་ཅན་དུ་བྱས་ནས་བཀུར་སྟིར་བྱེད། བླ་མར་བྱེད། རིམ་གྲོར་བྱེད། མཆོད་པར་བྱེད་དེ།
en: She will tame all the evil factions of non-Buddhists, and after erecting monumental stūpas to the Tathāgata in all locations throughout the continent of Jambudvīpa, she will pay homage to them, exalt them, honor them, and make offerings to them.
